#_*_ coding:utf-8 _*_
#开发人员：34431
#开发时间：2020-02-06 23:24
#文件名称:04.py
#开发工具：PyCharm

print('--------------------------------------')
print('|  ✈国内  |  国际港澳台  |  发现低价  |')
print('|航程类型 🔘单程 🔘往返 🔘多程(含缺口程)|')
print('|出发城市 上海(SHA)                    |')
print('|到达城市 中文/拼音                    |')
print('|出发日期 yyyy-mm-dd                   |')
print('|返回日期 yyyy-mm-dd                   |')
print('|         带儿童 带婴儿 儿童/婴儿票     |')
print('|         高级搜素                     |')
print('|         搜索                         |')
print('--------------------------------------')

print('---------------------------------------------------------------------------------------')
print('|昆明航空KY9382共享     16:05------------>18:25            准点率      ￥842 起 选为去程 |')
print('|波音737-800(中型)     龙嘉国际机场T2      禄口国际机场T2     47%        往返总价        |')
print('---------------------------------------------------------------------------------------')
print('|中国国航CA3682共享    16:05------------>18:25            准点率      ￥880 起 选为去程 |')
print('|波音737-800(中型)     龙嘉国际机场T2      禄口国际机场T2     47%        往返总价       |')
print('---------------------------------------------------------------------------------------')
print('|南方航空CZ6624        08:15------------>11:05            准点率      ￥1070起 选为去程 |')
print('|空中客车A320(中型)    龙嘉国际机场T1     禄口国际机场T2  83%            往返总价        |')
print('---------------------------------------------------------------------------------------')

