#_*_ coding:utf-8 _*_
#开发人员：34431
#开发时间：2020-02-07 13:02
#文件名称:06.py
#开发工具：PyCharm
print(" =========================== ")
print("│ **输入验证码               │")
print(" =========================== ")
print("│ <                          │")
print("│    请输入您收到的验证码     │")
print("│                            │")
print("│                            │")
print("│         □□□□               │")
print("│                            │")
print("│      1    2     3          │")
print("│                            │")
print("│      4    5     6          │")
print("│                            │")
print("│      7    8     9          │")
print("│                            │")
print("│           0     del        │")
print("│                            │")
print("│============================│")